app/Http/Controllers/CartController.php

delete from `cart_photo` where `cart_id` = 1 and `photo_variation_id` in (4)
insert into `cart_photo` (`cart_id`, `photo_variation_id`) values (1, 3)
---
    public function save(Request $request)
    {
        $request->validate([
            'product_variation_id'=>'required'
        ]);

        $cart=\App\Models\Cart::firstOrCreate([
            'session_Id' => session()->getId()
        ]);
        $cart->photovariations()->syncWithoutDetaching($request->product_variation_id);

select * from `carts` where `session_id` = '7oU8RgemDl1zoRHsVM8xkwhPqXSV60GEWNjUy6CB' limit 1
delete from `cart_photo` where `cart_id` = 1 and `photo_variation_id` in ('4')
---
    public function destroy(Request $request)
    {
        $cart = \App\Models\Cart::where('session_id',session()->getId())->first();
        $cart->photoVariations()->detach($request->id);