app/Providers/AppServiceProvider.php

    public function boot()
    {
        // dd(session()->getId());
        view::composer('*',function($view){
            $view->with('cart',\App\Models\Cart::where('session_id',session()->getId())->first());
        });
---
select * from `carts` where `session_id` = '5AvxVdTsNNCcJ7Fr9pucLC3mhZcTTeM5ezrYKnds' order by `created_at` desc limit 1
select * from `carts` where `session_id` = '7oU8RgemDl1zoRHsVM8xkwhPqXSV60GEWNjUy6CB' limit 1